////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получить таблицу свободных мест.
// 
// Параметры:
//  Период - Дата
//  АдресРегистрации - СправочникСсылка.АдресаРегистрации
// 
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Получить таблицу свободных мест
Функция ПолучитьТаблицуСвободныхМест(Период) Экспорт
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	//Запрос.УстановитьПараметр("АдресРегистрации",АдресРегистрации);
	
#Область ТекстЗапроса

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазмещениеСотрудниковСрезПоследних.Сотрудник,
	|	РазмещениеСотрудниковСрезПоследних.АдресРегистрации,
	|	РазмещениеСотрудниковСрезПоследних.Комната,
	|	РазмещениеСотрудниковСрезПоследних.Место,
	|	РазмещениеСотрудниковСрезПоследних.ДатаЗаселения,
	|	РазмещениеСотрудниковСрезПоследних.ДатаВыселения
	|ПОМЕСТИТЬ Занятые
	|ИЗ
	|	РегистрСведений.РазмещениеСотрудников.СрезПоследних(&Период, 
	//|АдресРегистрации = &АдресРегистрации
	|) КАК
	|		РазмещениеСотрудниковСрезПоследних
	|ГДЕ
	|	РазмещениеСотрудниковСрезПоследних.ДатаВыселения = ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Место
	|ПОМЕСТИТЬ ПроизвольнаяНумерация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	11
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	12
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	13
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	14
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КомнатыВагоны.Владелец КАК АдресРегистрации,
	|	КомнатыВагоны.Ссылка КАК Комната,
	|	ПроизвольнаяНумерация.Место
	|ПОМЕСТИТЬ ВсеМеста
	|ИЗ
	|	Справочник.КомнатыВагоны КАК КомнатыВагоны
	|		ЛЕВОЕ соединение ПроизвольнаяНумерация КАК ПроизвольнаяНумерация
	|		По Истина
	|		и КомнатыВагоны.КоличествоМест >= Место
	|ГДЕ
	//|	КомнатыВагоны.Владелец = &АдресРегистрации
	//|	И 
	|КомнатыВагоны.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеМеста.АдресРегистрации,
	|	ВсеМеста.Комната,
	|	ВсеМеста.Место
	|ИЗ
	|	ВсеМеста КАК ВсеМеста
	|		ЛЕВОЕ соединение Занятые КАК Занятые
	|		по ВсеМеста.АдресРегистрации = Занятые.АдресРегистрации
	|		И ВсеМеста.Комната = Занятые.Комната
	|		И ВсеМеста.Место = Занятые.Место
	|Где
	|	Занятые.Место Есть NUll";
	
#КонецОбласти

	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
