#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если  ОбменДанными.Загрузка Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеПроверятьЕдиницу") Тогда  //Запись новой единицы измерения
		УдалитьЭлементМассива("ЕдиницаИзмерения",ПроверяемыеРеквизиты);
	КонецЕсли;
	
	Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Блюда Тогда
		УдалитьЭлементМассива("ЕдиницаДляРецептов",ПроверяемыеРеквизиты);          
	Иначе
		УдалитьЭлементМассива("КоличествоБлюд",ПроверяемыеРеквизиты);          
	КонецЕсли;
	                                                                                                          
	Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Меню Тогда
		УдалитьЭлементМассива("ЕдиницаИзмерения",	ПроверяемыеРеквизиты);
		УдалитьЭлементМассива("ЕдиницаДляРецептов",	ПроверяемыеРеквизиты);
	Иначе
		УдалитьЭлементМассива("КатегорияМеню",	ПроверяемыеРеквизиты);
		УдалитьЭлементМассива("ВидСтола",		ПроверяемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти       

#Область СлужебныеПроцедурыИФункции
					 	
Процедура УдалитьЭлементМассива(ЗначениеЭлемента,МассивЭлементов)

	 Индекс = МассивЭлементов.Найти(ЗначениеЭлемента);
	 Если Не Индекс = Неопределено Тогда
	 
	 	МассивЭлементов.Удалить(Индекс);
	 
	 КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли