////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузкаСправочникаСотрудникиПоПолю(ТаблицаЗначений) Экспорт 
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТаблицаЗначений",ТаблицаЗначений);
	
#Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаЗначений.ФИОСотрудника КАК Наименование
	|ПОМЕСТИТЬ ТаблицаЗначений
	|ИЗ
	|	&ТаблицаЗначений КАК ТаблицаЗначений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНаименования.Наименование КАК Наименование,
	|	Сотрудники.ПометкаУдаления КАК ПометкаУдаления,
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Код КАК Код
	|ПОМЕСТИТЬ СправочникСотрудники
	|ИЗ
	|	Справочник.Сотрудники.НаименованияЗагрузок КАК ТаблицаНаименования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ТаблицаНаименования.Ссылка = Сотрудники.Ссылка
	|ГДЕ
	|	ТаблицаНаименования.Наименование В
	|			(ВЫБРАТЬ
	|				ТаблицаЗначений.Наименование КАК Наименование
	|			ИЗ
	|				ТаблицаЗначений КАК ТаблицаЗначений)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникСотрудники.Ссылка КАК Ссылка,
	|	СправочникСотрудники.Код КАК Код,
	|	СправочникСотрудники.Наименование КАК Наименование
	|ИЗ
	|	СправочникСотрудники КАК СправочникСотрудники
	|ГДЕ
	|	СправочникСотрудники.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаЗначений.Наименование КАК Наименование
	|ИЗ
	|	ТаблицаЗначений КАК ТаблицаЗначений
	|		ЛЕВОЕ СОЕДИНЕНИЕ СправочникСотрудники КАК СправочникСотрудники
	|		ПО ТаблицаЗначений.Наименование = СправочникСотрудники.Наименование
	|ГДЕ
	|	СправочникСотрудники.Наименование ЕСТЬ NULL
	|	ИЛИ СправочникСотрудники.ПометкаУдаления 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
#КонецОбласти

	Результат = Запрос.ВыполнитьПакет();
	
	РезультатПометкиУдаления = Результат[Результат.ВГраница()-1];
	Если Не РезультатПометкиУдаления.Пустой() Тогда
		
		МассивСообщений = Новый Массив;
		МассивСообщений.Добавить("Загружаются сотрудники помеченные на удаление");
		МассивСообщений.Добавить("~~~~~~~~~~~~~~~");
		
		Выборка = РезультатПометкиУдаления.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивСообщений.Добавить(СтрШаблон("Код %1; %2",Выборка.Код,Выборка.Наименование));
		КонецЦикла;
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрСоединить(МассивСообщений,Символы.ПС);
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;
	
	Если Результат[Результат.ВГраница()].Пустой() Тогда
		Возврат
	КонецЕсли;
	
	Выборка = Результат[Результат.ВГраница()].Выбрать();
	Пока Выборка.Следующий() Цикл
	
		СправочникОбъект = Справочники.Сотрудники.СоздатьЭлемент();
		СправочникОбъект.Наименование 	= Выборка.Наименование;
		СправочникОбъект.НаименованияЗагрузок.Добавить().Наименование = Выборка.Наименование;
	    СправочникОбъект.УстановитьНовыйКод();
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузкаСправочникаПоНаменованию(ТаблицаЗначений,ИмяСправочника,ИмяПоляТаблицы) Экспорт 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЗначений",ТаблицаЗначений);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаЗначений.ИмяПоляТаблицы КАК Наименование
	|ПОМЕСТИТЬ ТаблицаЗначений
	|ИЗ
	|	&ТаблицаЗначений КАК ТаблицаЗначений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИмяСправочника.Наименование КАК Наименование
	|ПОМЕСТИТЬ ИмяСправочника
	|ИЗ
	|	Справочник.ИмяСправочника КАК ИмяСправочника
	|ГДЕ
	|	ИмяСправочника.Наименование В
	|			(ВЫБРАТЬ
	|				ТаблицаЗначений.Наименование КАК Наименование
	|			ИЗ
	|				ТаблицаЗначений КАК ТаблицаЗначений)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаЗначений.Наименование КАК Наименование
	|ИЗ
	|	ТаблицаЗначений КАК ТаблицаЗначений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИмяСправочника КАК ИмяСправочника
	|		ПО ТаблицаЗначений.Наименование = ИмяСправочника.Наименование
	|ГДЕ
	|	ИмяСправочника.Наименование ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИмяСправочника",ИмяСправочника);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИмяПоляТаблицы",ИмяПоляТаблицы);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	
		СправочникОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
		СправочникОбъект.Наименование = Выборка.Наименование;
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

