
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияТоваров") Тогда
		
		 ЗаполнитьПоИнвентаризации(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	#Область ТекстЗапроса
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОприходованиеТоваров.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОприходованиеТоваров.МестоХранения КАК МестоХранения,
	|	ОприходованиеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ОприходованиеТоваровТовары.Количество КАК Количество
	|ИЗ
	|	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|		ПО ОприходованиеТоваровТовары.Ссылка = ОприходованиеТоваров.Ссылка
	|ГДЕ
	|	ОприходованиеТоваровТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОприходованиеТоваровТовары.НомерСтроки";
	
	#КонецОбласти
	
	
	Движения.ОстаткиПродуктовНаСкладах.Записывать = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОстаткиПродуктовНаСкладах.Добавить(),Выборка)
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоИнвентаризации(ДанныеЗаполнения) 

	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина)
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
	Запрос.Текст = "ВЫБРАТЬ
	|	ИнвентаризацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	ИнвентаризацияТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ИнвентаризацияТоваровТовары.КоличествоФакт - ИнвентаризацияТоваровТовары.Количество КАК Количество,
	|	 ИнвентаризацияТоваровТовары.ВесФакт - ИнвентаризацияТоваровТовары.Вес КАК Вес
	|ИЗ
	|	Документ.ИнвентаризацияТоваров.Товары КАК ИнвентаризацияТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияТоваров КАК ИнвентаризацияТоваров
	|		ПО ИнвентаризацияТоваровТовары.Ссылка = ИнвентаризацияТоваров.Ссылка
	|ГДЕ
	|	ИнвентаризацияТоваровТовары.Ссылка = &Ссылка
	|	И ИнвентаризацияТоваровТовары.Количество - ИнвентаризацияТоваровТовары.КоличествоФакт < 0
	|	И ИнвентаризацияТоваров.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияТоваров.МестоХранения КАК МестоХранения,
	|	ИнвентаризацияТоваров.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ИнвентаризацияТоваров КАК ИнвентаризацияТоваров
	|ГДЕ
	|	ИнвентаризацияТоваров.Ссылка = &Ссылка
	|	И ИнвентаризацияТоваров.Проведен";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Товары.Загрузить(Результат[0].Выгрузить());

	Выборка = Результат[1].Выбрать();
	Выборка.Следующий();
	
	МестоХранения 		= Выборка.МестоХранения;
	ДокументОснование 	= Выборка.ДокументОснование;
	

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
