////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вызыватся при формировании данных загрузки состояний сотрудников.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Инициализировать таблицу состояний:
// * ФИОСотрудника 			- Строка 
// * ДолжностьСтрока 		- Строка
// * ПодразделенияСтрока 	- Строка
Функция ИнициализироватьТаблицуСостояний() Экспорт

	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ТаблицаЗначений.Колонки.Добавить("ФИОСотрудника",		Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(100)));
	ТаблицаЗначений.Колонки.Добавить("ДолжностьСтрока",		Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150)));
	ТаблицаЗначений.Колонки.Добавить("ПодразделенияСтрока",	Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(100)));

	Возврат ТаблицаЗначений;
	
КонецФункции // ИнициализироватьТаблицуСостояний()

// Вызыватся при загрузке отклонений из ERP.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Инициализировать таблицу отклонений:
// * ФИОСотрудника 		- Строка
// * ТипДокументаСтрока - Строка
// * Номер 				- Строка
// * ДатаДокумента 		- Дата
// * ДатаНачала 		- Дата
// * ДатаОкончания 		- Дата
Функция ИнициализироватьТаблицуОтклонений() Экспорт

	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ТаблицаЗначений.Колонки.Добавить("ФИОСотрудника",		Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(100)));
	ТаблицаЗначений.Колонки.Добавить("ТипДокументаСтрока",	Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150)));
	
	ТаблицаЗначений.Колонки.Добавить("Номер",				Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(52)));
	ТаблицаЗначений.Колонки.Добавить("ДатаДокумента",		Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ДатаНачала",			Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ДатаОкончания",		Новый ОписаниеТипов("Дата"));

	Возврат ТаблицаЗначений;


КонецФункции // ИнициализироватьТаблицуОтклонений()

// Вызыватся при загрузке заявок отсутсвия из ДО
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Инициализировать таблицу заявок:
// * ФИОСотрудника 		- Строка
// * ДатаДокумента 		- Дата
// * ДатаНачала 		- Дата
// * ДатаОкончания 		- Дата
// * ВремяНачала 		- Дата
// * ВремяОкончания 	- Дата
// * Содержание 		- Строка
// * РегистрационныйНомер - Строка
// * ПричинаОтсутствияСтрока - Строка
Функция ИнициализироватьТаблицуЗаявок() Экспорт

	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ТаблицаЗначений.Колонки.Добавить("ФИОСотрудника",		Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(100)));
	
	ТаблицаЗначений.Колонки.Добавить("ДатаДокумента",		Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ДатаНачала",			Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ДатаОкончания",		Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ВремяНачала",			Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ВремяОкончания",			Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("Содержание",				Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("РегистрационныйНомер",	Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(40)));
	ТаблицаЗначений.Колонки.Добавить("ПричинаОтсутствияСтрока",	Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(100)));
	ТаблицаЗначений.Колонки.Добавить("Сотрудник",				Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаЗначений.Колонки.Добавить("ПричинаОтсутствия",		Новый ОписаниеТипов("СправочникСсылка.ПричиныОтсутсвия"));
		
	Возврат ТаблицаЗначений;

КонецФункции // ИнициализироватьТаблицуОтклонений()

// Вызывается при загрузке загрузке данынх проходов ч/з турникеты
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Инициализировать таблицу значений таблицы ошибок:
// * ФИОСотрудника 	- Строка
// * Сотрудник 		- СправочникСсылка.Сотрудники
// * НеЗагружать 	- Булево
// * СоздатьНовый 	- Булево
Функция ИнициализироватьТаблицуЗначенийТаблицыОшибок() Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ТаблицаЗначений.Колонки.Добавить("ФИОСотрудника",Новый ОписаниеТипов("Строка", , ,Новый КвалификаторыСтроки(100)));
	ТаблицаЗначений.Колонки.Добавить("Сотрудник",	Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаЗначений.Колонки.Добавить("НеЗагружать",	Новый ОписаниеТипов("Булево"));
	ТаблицаЗначений.Колонки.Добавить("СоздатьНовый",Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаЗначений;
	
КонецФункции // ИнициализироватьТаблицуЗначенийТаблицыОшибок()

// Вызывается при загрузке загрузке данынх проходов ч/з турникеты
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Инициализировать таблицу значений таблицы загрузки:
// * Вход 			- Дата
// * Выход 			- Дата
// * Дата 			- Дата
// * ДатаВыход 		- Дата
// * Должность 		- Строка
// * Подразделение 	- Строка
// * Присутствие 	- Дата
// * Сотрудник 		- СправочникСсылка.Сотрудники
// * ТабельныйНомер - Строка
// * ФИОСотрудника 	- Строка
Функция ИнициализироватьТаблицуЗначенийТаблицыЗагрузки() Экспорт

	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Вход", 		Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("Выход", 		Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("Дата", 		Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("ДатаВыход", 	Новый ОписаниеТипов("Дата"));

	ТаблицаЗначений.Колонки.Добавить("Должность",		Новый ОписаниеТипов("Строка", , ,Новый КвалификаторыСтроки(100)));
	ТаблицаЗначений.Колонки.Добавить("Подразделение",	Новый ОписаниеТипов("Строка", , ,Новый КвалификаторыСтроки(100)));
	ТаблицаЗначений.Колонки.Добавить("Присутствие",		Новый ОписаниеТипов("Дата"));
	ТаблицаЗначений.Колонки.Добавить("Сотрудник",   	Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаЗначений.Колонки.Добавить("ТабельныйНомер",	Новый ОписаниеТипов("Строка", , ,Новый КвалификаторыСтроки(10)));
	ТаблицаЗначений.Колонки.Добавить("ФИОСотрудника", 	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(100)));

	Возврат ТаблицаЗначений;
	
КонецФункции // ИнициализироватьТаблицуЗначенийТаблицыОшибок()

#КонецОбласти

#КонецЕсли