////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаИзмененияПриИзменении(Элемент)
	Объект.ДатаИзменения = НачалоМесяца(Объект.ДатаИзменения);
КонецПроцедуры

#КонецОбласти