#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	ПроходыPerco.Территория КАК Территория,
	|	ПроходыPercoИсходныеДанные.Сотрудник КАК Сотрудник,
	|	ПроходыPercoИсходныеДанные.Дата КАК Дата,
	|	ПроходыPercoИсходныеДанные.Вход КАК ВходДатой,
	|	ПроходыPercoИсходныеДанные.Выход КАК ВыходДатой,
	|	ПроходыPercoИсходныеДанные.Присутствие КАК ПрисутствиеДатой,
	|	ПроходыPercoИсходныеДанные.Ссылка КАК ДокументДвижения,
	|	ПроходыPercoИсходныеДанные.ДатаВыход КАК ДатаВыход,
	|	ПроходыPercoИсходныеДанные.НомерСтроки КАК СтрокаДокумента
	|ИЗ
	|	Документ.ПроходыPerco.ИсходныеДанные КАК ПроходыPercoИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроходыPerco КАК ПроходыPerco
	|		ПО ПроходыPercoИсходныеДанные.Ссылка = ПроходыPerco.Ссылка
	|ГДЕ
	|	ПроходыPercoИсходныеДанные.Ссылка = &Ссылка
	|	И НЕ ПроходыPercoИсходныеДанные.Дата = ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Дата,
	|	Территория";
	
	
	Движения.УчетРабочегоВремениСотрудников.Загрузить(Запрос.Выполнить().Выгрузить());
	Движения.УчетРабочегоВремениСотрудников.Записывать = Истина;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;
	
	Если Территория = Перечисления.Территории.Москва Тогда
		ЗаданияРасчета  = Перечисления.ЗаданияРасчета.ЗагрузкаДанныхПроходовМосква
	Иначе
		ЗаданияРасчета  = Перечисления.ЗаданияРасчета.ЗагрузкаДанныхПроходовРогачево
	КонецЕсли;

	КонсолидацияРегистрЗаданий.ЗаписатьПервичныеДанныеВРегистрЗаданий(Отказ,ЗаданияРасчета,Ссылка,Дата,Проведен,ПометкаУдаления);
	  
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
