#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
//@skip-check doc-comment-parameter-section
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	НастройкиОтчета.Описание = НСтр("ru = 'Состав блюд.'");

	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СоставБлюда");
	НастройкиВарианта.Описание = НСтр("ru = 'Отражение составов блюд.'");
	
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

    НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СоставБлюдаОтбор");
	НастройкиВарианта.Описание = НСтр("ru = 'Отражение состава блюда.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;  
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

//@skip-check module-structure-top-region
#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//@skip-check module-structure-method-in-regions
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.СоставБлюда) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.СоставБлюда.ПолноеИмя();
		//@skip-check bsl-nstr-string-literal-format
		КомандаОтчет.Представление = НСтр("ru = 'Состав блюда';
											|en = 'Menu composition'");
		
		
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", "СоставБлюдаОтбор");
		КомандаОтчет.КлючВарианта = "СоставБлюдаОтбор";
		
		Возврат КомандаОтчет;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли