
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Период",ПериодРегистрации);
	
#Область ТекстЗапроса
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.Номенклатура КАК Номенклатура,
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.Цена КАК Цена,
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.ЦенаЗакупки КАК ЦенаРасчет,
	               |	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период
	               |ИЗ
	               |	Документ.УстановкаРасчетЦенНоменклатуры.ЦеныПродуктов КАК УстановкаРасчетЦенНоменклатурыЦеныПродуктов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО УстановкаРасчетЦенНоменклатурыЦеныПродуктов.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	УстановкаРасчетЦенНоменклатурыЦеныПродуктов.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.Номенклатура,
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.Цена,
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.ЦенаРасчетная,
	               |	СправочникНоменклатура.ВидНоменклатуры,
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.НомерСтроки,
	               |	&Период
	               |ИЗ
	               |	Документ.УстановкаРасчетЦенНоменклатуры.ЦеныБлюд КАК УстановкаРасчетЦенНоменклатурыЦеныБлюд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО УстановкаРасчетЦенНоменклатурыЦеныБлюд.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	УстановкаРасчетЦенНоменклатурыЦеныБлюд.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.Номенклатура,
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.Цена,
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.ЦенаРасчетная,
	               |	СправочникНоменклатура.ВидНоменклатуры,
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.НомерСтроки,
	               |	&Период
	               |ИЗ
	               |	Документ.УстановкаРасчетЦенНоменклатуры.ЦеныМеню КАК УстановкаРасчетЦенНоменклатурыЦеныМеню
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО УстановкаРасчетЦенНоменклатурыЦеныМеню.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	УстановкаРасчетЦенНоменклатурыЦеныМеню.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидНоменклатуры,
	               |	НомерСтроки";
	
#КонецОбласти

	Результат = Запрос.ВыполнитьПакет();
	
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ЦеныНоменклатуры.Добавить(),Выборка)
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти	

#КонецЕсли