////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	Если  ТипПодключения =  Перечисления.ТипыПодключения.WebСервис Тогда
	
		ПроверяемыеРеквизиты.Добавить("WebСервисИмяБазы");
		ПроверяемыеРеквизиты.Добавить("WebСервисИмяСервера");         
		ПроверяемыеРеквизиты.Добавить("WebСервисИмяПользователя");             
		ПроверяемыеРеквизиты.Добавить("WebСервисПароль");                  
	
	КонецЕсли;
	
	Если  ТипПодключения =  Перечисления.ТипыПодключения.ПодключениеCOM Тогда
		ПроверяемыеРеквизиты.Добавить("ИмяБазы");
		ПроверяемыеРеквизиты.Добавить("ИмяСервера");                   
		ПроверяемыеРеквизиты.Добавить("ИмяПользователя");             
		ПроверяемыеРеквизиты.Добавить("Пароль");                  
		ПроверяемыеРеквизиты.Добавить("АдресСервера");                  
		
	
	КонецЕсли;
	
	Если  ТипПодключения =  Перечисления.ТипыПодключения.ПодключениеHTTP
		Или ТипПодключения.Пустая() Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИмяПубликации");
		ПроверяемыеРеквизиты.Добавить("КорневойURL");                   
		ПроверяемыеРеквизиты.Добавить("ИмяПользователяСервиса");             
		ПроверяемыеРеквизиты.Добавить("ПарольСервиса");                                  
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли