#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
//	ПозицияПервогоПробела = СтрНайти(Наименование," ");
//	Если Не ПозицияПервогоПробела = 0 И УдалитьФамилия <> Лев(Наименование,ПозицияПервогоПробела-1) Тогда
//		УдалитьФамилия = Лев(Наименование,ПозицияПервогоПробела-1);
//	Иначе
//		УдалитьФамилия = Наименование
//	КонецЕсли;
//
//	Если ОбменДанными.Загрузка Тогда
//				
//		Запрос = Новый Запрос;
//		Запрос.УстановитьПараметр("НаименованияЗагрузок",НаименованияЗагрузок.Выгрузить());
//		Запрос.Текст = "ВЫБРАТЬ
//		|	СотрудникиНаименованияЗагрузок.Наименование КАК Наименование
//		|ПОМЕСТИТЬ НаименованияЗагрузок
//		|ИЗ
//		|	&НаименованияЗагрузок КАК СотрудникиНаименованияЗагрузок
//		|ГДЕ
//		|	СотрудникиНаименованияЗагрузок.Наименование <> """"
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	НаименованияЗагрузок.Наименование КАК Наименование
//		|ИЗ
//		|	НаименованияЗагрузок КАК НаименованияЗагрузок
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	Наименование";
//		
//		НаименованияЗагрузок.Загрузить(Запрос.Выполнить().Выгрузить());
//		
//		Возврат;
//	КонецЕсли;
//	
//	Если ПометкаУдаления Тогда
//		НаименованияЗагрузок.Очистить();
//	Иначе
//		Если НаименованияЗагрузок.Найти(Наименование,"Наименование")= Неопределено Тогда
//			НаименованияЗагрузок.Добавить().Наименование = Наименование
//		КонецЕсли;
//	КонецЕсли;
	
	//ПроверкаКорректностиНаименованийЗагрузок(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаКорректностиНаименованийЗагрузок(Отказ)

//	МассивСообщений = Новый Массив;
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
//	Запрос.Текст = "ВЫБРАТЬ
//	|	ТаблицаНаименований.Наименование КАК Наименование
//	|ПОМЕСТИТЬ ТекущиеНаименования
//	|ИЗ
//	|	&ТаблицаНаименований КАК ТаблицаНаименований
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СотрудникиНаименования.Наименование КАК Наименование,
//	|	СотрудникиНаименования.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.Сотрудники.НаименованияЗагрузок КАК СотрудникиНаименования
//	|ГДЕ
//	|	СотрудникиНаименования.Наименование В
//	|			(ВЫБРАТЬ
//	|				ТекущиеНаименования.Наименование КАК Наименование
//	|			ИЗ
//	|				ТекущиеНаименования КАК ТекущиеНаименования)
//	|	И СотрудникиНаименования.Ссылка <> &Ссылка
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Наименование,
//	|	Ссылка";
//
//	Запрос.УстановитьПараметр("ТаблицаНаименований",НаименованияЗагрузок.Выгрузить());
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Количество() > 0 Тогда
//		МассивСообщений.Добавить(">В табличной части ""Наименования загрузок"" обнаружены повторяющиеся ФИО<");	
//	КонецЕсли;
//	Пока Выборка.Следующий() Цикл
//		МассивСообщений.Добавить(СтрШаблон("%1 %2",Выборка.Наименование,Строка(Выборка.Ссылка)));
//	КонецЦикла;
//
//		
//	Если МассивСообщений.Количество() > 0  Тогда
//	
//		Отказ = Истина;
//		
//		СообщениеПользователю = Новый СообщениеПользователю;
//		СообщениеПользователю.Текст =  СтрСоединить(МассивСообщений,Символы.ПС);
//		СообщениеПользователю.Сообщить();
//	
//	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли