#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	//@skip-check module-structure-top-region
	#Область ДляВызоваИзДругихПодсистем
	
	// СтандартныеПодсистемы.ВариантыОтчетов
	// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
	//
	//@skip-check module-structure-method-in-regions
	//@skip-check doc-comment-parameter-section
	//@skip-check doc-comment-parameter-section
	Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
		
		МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
		НастройкиОтчета.Описание = НСтр("ru = 'Изготовленные блюда'");
		
		НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ИзготовленныеБлюда");
		НастройкиВарианта.Описание = НСтр("ru = 'Изготовленные блюда.'");
		
		НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ИзготовленныеБлюдаВидыСтолов");
		НастройкиВарианта.Описание = НСтр("ru = 'Изготовленные блюда в рарезе столов.'");

	КонецПроцедуры
	
	// Конец СтандартныеПодсистемы.ВариантыОтчетов
	#КонецОбласти
	
#КонецЕсли