////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьСправочникаАдресаПроживания");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитов

#КонецОбласти

#Область ОбработчикиСобытийТаблиц

#КонецОбласти

#Область Команды

#КонецОбласти

#Область СлужебныеПроцедуры

#КонецОбласти