
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//Если ОбменДанными.Загрузка Тогда
//     Возврат;
//КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
#Область ТекстЗапроса

	Запрос.Текст = "ВЫБРАТЬ
				   |	ЗаселениеСотрудников.Дата КАК Период,
				   |	ЗаселениеСотрудников.Ссылка КАК Регистратор,
				   |	ЗаселениеСотрудников.АдресРегистрации,
				   |	ЗаселениеСотрудников.ДатаЗаселения,
				   |	ЗаселениеСотрудниковДетальныеЗаписи.Сотрудник,
				   |	ЗаселениеСотрудниковДетальныеЗаписи.Комната,
				   |	ЗаселениеСотрудниковДетальныеЗаписи.Место,
				   |	ЗаселениеСотрудников.СтоимостьПроживания
				   |ИЗ
				   |	Документ.ЗаселениеСотрудников.ДетальныеЗаписи КАК ЗаселениеСотрудниковДетальныеЗаписи
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаселениеСотрудников КАК ЗаселениеСотрудников
				   |		ПО ЗаселениеСотрудниковДетальныеЗаписи.Ссылка = ЗаселениеСотрудников.Ссылка
				   |ГДЕ
				   |	ЗаселениеСотрудниковДетальныеЗаписи.Ссылка = &Ссылка
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	ЗаселениеСотрудниковДетальныеЗаписи.НомерСтроки";

#КонецОбласти
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.РазмещениеСотрудников.Добавить(),Выборка);
	КонецЦикла;
	
	Движения.РазмещениеСотрудников.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции

#КонецОбласти 

#КонецЕсли


