#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		Дата = НачалоМесяца(Дата);
		ПроверкаУникальностиДокумента(Отказ);
		
	Иначе
		
		МассивДаты = Новый Массив;
		МассивДаты.Добавить(НачалоМесяца(Дата));
		КонсолидацияРегистрЗаданий.ОтменитьРассчетВремениВПериоде(МассивДаты);
		
	КонецЕсли;
	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаУникальностиДокумента(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	РасчетРабочегоВремени.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасчетРабочегоВремени КАК РасчетРабочегоВремени
	|ГДЕ
	|	РасчетРабочегоВремени.Дата = &Дата 
	|	И РасчетРабочегоВремени.Проведен
	|	И НЕ РасчетРабочегоВремени.Ссылка = &Ссылка";
	
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		 ОбщегоНазначения.СообщитьПользователю("Существуют проведенные документы этого периода",Ссылка,,,Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли