#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъяснительнаяЗаписка.Сотрудник КАК Сотрудник,
	               |	ОбъяснительнаяЗаписка.ДатаСобытия КАК Дата,
	               |	ОбъяснительнаяЗаписка.Ссылка КАК ОбъяснительнаяЗаписка,
	               |	ОбъяснительнаяЗаписка.Ссылка КАК ДокументДвижения
	               |ИЗ
	               |	Документ.ОбъяснительнаяЗаписка КАК ОбъяснительнаяЗаписка
	               |ГДЕ
	               |	ОбъяснительнаяЗаписка.Ссылка = &Ссылка";
	
	Движения.УчетРабочегоВремениСотрудников.Загрузить(Запрос.Выполнить().Выгрузить());
	Движения.УчетРабочегоВремениСотрудников.Записывать = Истина;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;

	ЗаданияРасчета  = Перечисления.ЗаданияРасчета.ОформлениеОбъяснений;
	КонсолидацияРегистрЗаданий.ОтменитьРегистрациюРасчетаПоДате(ЗаданияРасчета,Дата);

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
