////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ТаблицаОшибок") = Ложь Тогда
		ВызватьИсключение НСтр("ru='Не предусмотрено использование обработки вне контекста загрузки'");
	КонецЕсли;	
	
	АдресВХранилище = Параметры.ТаблицаОшибок;
	
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОшибок.Добавить(),СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибок

&НаКлиенте
Процедура ТаблицаОшибокСотрудникПриИзменении(Элемент)
	ОбработкаИзмененияЗагружаемогоСотрудника("Сотрудник");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокСоздатьНовыйПриИзменении(Элемент)
	ОбработкаИзмененияЗагружаемогоСотрудника("СоздатьНовый");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокНеЗагружатьПриИзменении(Элемент)
	ОбработкаИзмененияЗагружаемогоСотрудника("НеЗагружать");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗавершитьОК(Команда)
	Закрыть(ПолучитьАдресВХранилище());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаИзмененияЗагружаемогоСотрудника(ИмяРеквизита)	
	
	ТекущиеДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные[ИмяРеквизита]) Тогда
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить("НеЗагружать");
		МассивРеквизитов.Добавить("СоздатьНовый");
		МассивРеквизитов.Добавить("Сотрудник");

		МассивРеквизитов.Удалить(МассивРеквизитов.Найти(ИмяРеквизита));
		
		Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
			ТекущиеДанные[ИмяРеквизита] = Неопределено
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры // ОбработкаИзмененияЗагружаемогоСотрудника()

&НаСервере
Функция ПолучитьАдресВХранилище()
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОшибок.Выгрузить(),АдресВХранилище);
КонецФункции // ПолучитьАдресВХранилище()

#КонецОбласти