////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("МассивОшибок") = Ложь Тогда
		ВызватьИсключение НСтр("ru='Не предусмотрено использование обработки вне контекста загрузки'");
	КонецЕсли;	

	Для Каждого ЭлементМассива Из Параметры.МассивОшибок Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОшибок.Добавить(),ЭлементМассива);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОшибок

&НаКлиенте
Процедура ТаблицаОшибокСотрудникПриИзменении(Элемент)
	ОбработкаИзмененияЗагружаемогоСотрудника("Сотрудник");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокСоздатьНовыйПриИзменении(Элемент)
	ОбработкаИзмененияЗагружаемогоСотрудника("СоздатьНовый");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокНеЗагружатьПриИзменении(Элемент)
	ОбработкаИзмененияЗагружаемогоСотрудника("НеЗагружать");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьОК(Команда)
	
	МассивОшибок = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаОшибок Цикл
		Структура = КонсолидацияКлиентСервер.ИнициализироватьСтруктуруТаблицыОшибок();
		ЗаполнитьЗначенияСвойств(Структура,СтрокаТаблицы);
		МассивОшибок.Добавить(Структура);
	КонецЦикла;
	
	Закрыть(МассивОшибок);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаИзмененияЗагружаемогоСотрудника(ИмяРеквизита)	
	
	ТекущиеДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные[ИмяРеквизита]) Тогда
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить("НеЗагружать");
		МассивРеквизитов.Добавить("СоздатьНовый");
		МассивРеквизитов.Добавить("Сотрудник");

		МассивРеквизитов.Удалить(МассивРеквизитов.Найти(ИмяРеквизита));
		
		Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
			ТекущиеДанные[ИмяРеквизита] = Неопределено
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры // ОбработкаИзмененияЗагружаемогоСотрудника()

#КонецОбласти