////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПаспортКачества_Реализации_Р2") Тогда
//		ПараметрыПечати.Вставить("ИмяКоманды","ПФ_MXL_ПаспортКачества_Реализации_Р2");
//		
//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
//		КоллекцияПечатныхФорм,
//		"ПФ_MXL_ПаспортКачества_Реализации_Р2", НСтр("ru = 'Паспорт качества реализации';
//													|en = 'Passport of quality for sale'"),
//		СформироватьТабличныйДокумент(МассивОбъектов, ОбъектыПечати,ПараметрыПечати), ,
//					"Документ.Монолит_ПаспортКачестваРеализации.ПФ_MXL_ПаспортКачества_Реализации");
	КонецЕсли;


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
