///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс


// Получить представление периода регистрации.
// 
// Параметры:
//  ПериодРегистрации - Дата
//  КалендарныйПериод - Строка - Календарный период
// 
// Возвращаемое значение:
//  Строка - Получить представление периода регистрации
Функция ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации, КалендарныйПериод = "Месяц") Экспорт

	Если КалендарныйПериод = "Месяц" Тогда
		Возврат Формат(ПериодРегистрации, "ДФ='MMMM yyyy'")
	ИначеЕсли КалендарныйПериод = "Квартал" Тогда
		
			Возврат СтрШаблон("%1 - %2",Формат(НачалоКвартала(ПериодРегистрации), "ДФ='MMMM yyyy'"),
										Формат(КонецКвартала(ПериодРегистрации), "ДФ='MMMM yyyy'"));
		
	КонецЕсли;

КонецФункции

#КонецОбласти
