#Область ПрограммныйИнтерфейс

Функция ИнициализироватьСтруктуруТаблицыОшибок() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("ФИОСотрудника");
	Структура.Вставить("Сотрудник");
	Структура.Вставить("НеЗагружать");
	Структура.Вставить("СоздатьНовый");
	
	Возврат Структура;
	
КонецФункции // ИнициализироватьСтруктуруТаблицыОшибок()

Функция ИнициализироватьСтруктуруТаблицыПроходовPERCo() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Вход");
	Структура.Вставить("Выход");
	Структура.Вставить("Дата");
	Структура.Вставить("ДатаВыход");
	
	Структура.Вставить("Должность");
	Структура.Вставить("Подразделение");
	Структура.Вставить("Присутствие");
	Структура.Вставить("Сотрудник");
	Структура.Вставить("ТабельныйНомер");
	Структура.Вставить("ФИОСотрудника");
	Структура.Вставить("Наименование");
	
	Возврат Структура;
	
КонецФункции // ИнициализироватьСтруктуруТаблицыОшибок()

Функция ИнициализироватьСтруктуруТаблицыЗаявок() Экспорт

	Структура = Новый Структура;
	
	Структура.Вставить("Сотрудник");
	Структура.Вставить("ПричинаОтсутствия");
	
	Структура.Вставить("ДатаДокумента");
	Структура.Вставить("ДатаНачала");
	Структура.Вставить("ДатаОкончания");
	Структура.Вставить("ВремяНачала");
	Структура.Вставить("ВремяОкончания");
	Структура.Вставить("Содержание");
	Структура.Вставить("РегистрационныйНомер");
	Структура.Вставить("ПричинаОтсутствияСтрока");
	
	Структура.Вставить("ФИОСотрудника");
	
	Возврат Структура;
	
КонецФункции // ИнициализироватьСтруктуруТаблицыЗаявок()

Функция ИнициализироватьСтруктуруТаблицыОтклонений() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Сотрудник");
	Структура.Вставить("ТипДокумента");
	
	Структура.Вставить("Номер");
	Структура.Вставить("ДатаДокумента");
	Структура.Вставить("ДатаНачала");
	Структура.Вставить("ДатаОкончания");
	
	Структура.Вставить("ФИОСотрудника");

	Возврат Структура;	
	
КонецФункции // ИнициализироватьСтруктуруТаблицыОтклонений()

Функция ИнициализироватьСтруктуруТаблицыСостояний() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Сотрудник");
	Структура.Вставить("Должность");
	Структура.Вставить("Подразделение");
	
	Структура.Вставить("ФИОСотрудника");
	Структура.Вставить("ДолжностьСтрока");
	Структура.Вставить("ПодразделениеСтрока");

	Возврат Структура;	
	
КонецФункции // ИнициализироватьСтруктуруТаблицыСостояний()

#КонецОбласти