#Область ПрограммныйИнтерфейс

Функция ИнициализироватьСтруктуруТаблицыОшибок() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("ФИОСотрудника");
	Структура.Вставить("Сотрудник");
	Структура.Вставить("НеЗагружать");
	Структура.Вставить("СоздатьНовый");
	
	Возврат Структура;
	
КонецФункции // ИнициализироватьСтруктуруТаблицыОшибок()

Функция ИнициализироватьСтруктуруТаблицыЗагрузок() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Вход");
	Структура.Вставить("Выход");
	Структура.Вставить("Дата");
	Структура.Вставить("ДатаВыход");
	Структура.Вставить("Должность");
	Структура.Вставить("Подразделение");
	Структура.Вставить("Присутствие");
	Структура.Вставить("Сотрудник");
	Структура.Вставить("ТабельныйНомер");
	Структура.Вставить("ФИОСотрудника");
	
	Возврат Структура;
	
КонецФункции // ИнициализироватьСтруктуруТаблицыОшибок()

Функция ИнициализироватьСтруктуруИсходныхДанных() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Сотрудник");
	Структура.Вставить("Вход");
	Структура.Вставить("Выход");
	Структура.Вставить("Дата");
	Структура.Вставить("ДатаВыход");
	Структура.Вставить("Присутствие");
	Структура.Вставить("Наименование");
	
	Возврат Структура;
	
КонецФункции // ИнициализироватьСтруктуруИсходныхДанных()

Функция ИнициализироватьСтруктуруТаблицыЗаявок() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("ФИОСотрудника");
	Структура.Вставить("ДатаДокумента");
	Структура.Вставить("ДатаНачала");
	Структура.Вставить("ДатаОкончания");
	Структура.Вставить("ВремяНачала");
	Структура.Вставить("ВремяОкончания");
	Структура.Вставить("Содержание");
	Структура.Вставить("РегистрационныйНомер");
	Структура.Вставить("ПричинаОтсутствияСтрока");
	Структура.Вставить("Сотрудник");
	Структура.Вставить("ПричинаОтсутствия");
	
	Возврат Структура;
	
КонецФункции // ИнициализироватьСтруктуруТаблицыЗаявок()


#КонецОбласти