
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидНоменклатуры") Тогда
		
		ОтборПоВиду = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВиду.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
		ОтборПоВиду.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоВиду.ПравоеЗначение = Параметры.ВидНоменклатуры; 
		
	КонецЕсли;
	
	Если Параметры.Свойство("СоставМеню") Тогда
	
		ОтборПоВиду = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВиду.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
		ОтборПоВиду.ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборПоВиду.ПравоеЗначение 	= Параметры.СоставМеню; 
	
	КонецЕсли;
	
	Если Параметры.Свойство("ДляМеню") Тогда
	
		ОтборПоВиду = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВиду.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДляМеню");
		ОтборПоВиду.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоВиду.ПравоеЗначение 	= Истина; 
	
	КонецЕсли;
	
	Если Параметры.Свойство("ДляРецептов") Тогда
	
		ОтборПоВиду = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВиду.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДляРецептов");
		ОтборПоВиду.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоВиду.ПравоеЗначение 	= Истина; 
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти