
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
#Область ТекстЗапроса
Запрос.Текст = "ВЫБРАТЬ
|	ПеремещениеТоваров.Дата КАК Период,
|	ПеремещениеТоваров.МестоОтгрузки КАК МестоОтгрузки,
|	ПеремещениеТоваров.МестоПриемки КАК МестоПриемки,
|	ПеремещениеТоваровТовары.НомерСтроки КАК НомерСтроки,
|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
|	ПеремещениеТоваровТовары.Количество КАК Количество
|ПОМЕСТИТЬ ТаблицаТовары
|ИЗ
|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
|		ПО ПеремещениеТоваровТовары.Ссылка = ПеремещениеТоваров.Ссылка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ТаблицаТовары.Период КАК Период,
|	ТаблицаТовары.МестоОтгрузки КАК МестоХранения,
|	ТаблицаТовары.Номенклатура КАК Номенклатура,
|	ТаблицаТовары.Количество КАК Количество,
|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
|ИЗ
|	ТаблицаТовары КАК ТаблицаТовары
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ТаблицаТовары.Период,
|	ТаблицаТовары.МестоПриемки,
|	ТаблицаТовары.Номенклатура,
|	ТаблицаТовары.Количество,
|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
|	ТаблицаТовары.НомерСтроки
|ИЗ
|	ТаблицаТовары КАК ТаблицаТовары
|
|УПОРЯДОЧИТЬ ПО
|	ВидДвижения,
|	НомерСтроки";
	
#КонецОбласти

	Движения.ОстаткиПродуктовНаСкладах.Записывать = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОстаткиПродуктовНаСкладах.Добавить(),Выборка)
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти	
//СДЕЛАТЬ КОНТРОЛЬ ПРОВЕДЕНИЯ И ОТМЕНЫ ПРОВЕДЕНИЯ
#КонецЕсли