
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЕдиницаПоКлассификаторуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

    ОткрытьФорму("Справочник.ЕдиницыИзмерения.Форма.КлассификаторЕдиницИзмерения",
				,
				,
				,
				,
				,
				Новый ОписаниеОповещения("ПодобратьИзКлассификатораЗавершение", ЭтотОбъект),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

 //@skip-check module-structure-form-event-regions
 //@skip-check doc-comment-parameter-section
 &НаКлиенте
Процедура ПодобратьИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("КоличествоНовыхЭлементов") Тогда
		
		Если ТипЗнч(Результат.НовыеЭлементы[0]) = Тип("Структура") Тогда
		
			Объект.ЕдиницаПоКлассификатору = Результат.НовыеЭлементы[0].Код;
			Если Объект.Код = "" Тогда
				Объект.Код = Результат.НовыеЭлементы[0].Код;	
			КонецЕсли;
			Если Объект.Наименование = "" Тогда
				Объект.Наименование = Результат.НовыеЭлементы[0].Наименование;	
			КонецЕсли;
		   	Если Объект.НаименованиеПолное = "" Тогда
				Объект.НаименованиеПолное = Результат.НовыеЭлементы[0].НаименованиеПолное;	
			КонецЕсли;
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти 