////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаселениеСотрудников") Тогда
		ЗаполнитьПоЗаселениюСотрудников(ДанныеЗаполнения, "ЗаселениеСотрудников");
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеСотрудников") Тогда
		ЗаполнитьПоЗаселениюСотрудников(ДанныеЗаполнения, "ПеремещениеСотрудников");
	КонецЕсли;
	
	Отвественный = Пользователи.ТекущийПользователь();
	ДатаЗаселения = ТекущаяДатаСеанса();
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОбщежитиеФункцииСервер.ПроверкаЗаселенных(Отказ,ДетальныеЗаписи,Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не Отказ Тогда
		ОбщежитиеФункцииСервер.ЗаписатьДатуВыселенияВИсториюРазмещенияСотрудников(Ссылка);
		ОбщежитиеФункцииСервер.ОсвободитьЗанятыеМестаОбщежитие(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДетальныеЗаписи.Очистить();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоЗаселениюСотрудников(ДанныеЗаполнения,ИмяДокумента)
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);

#Область ТекстЗапроса

	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументДетальныеЗаписи.НомерСтроки КАК НомерСтроки,
	|	ДокументДетальныеЗаписи.Сотрудник
	|ИЗ
	|	РегистрСведений.ЗанятыеМестаОбщежитие КАК ЗанятыеМестаОбщежитие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеСотрудников.ДетальныеЗаписи КАК ДокументДетальныеЗаписи
	|		ПО ДокументДетальныеЗаписи.Сотрудник = ЗанятыеМестаОбщежитие.Сотрудник
	|ГДЕ
	|	ДокументДетальныеЗаписи.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

#КонецОбласти

	Запрос.Текст = СтрЗаменить(Запрос.Текст,".ПеремещениеСотрудников.",ИмяДокумента);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДетальныеЗаписи.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры


#КонецОбласти 

#КонецЕсли


