////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения

#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
#Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	|	Детали.АдресРегистрации,
	|	Детали.Стоимость,
	|	Шапка.ДатаИзменения КАК Период,
	|	Детали.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.ПриказОбУстанволенииСтоимостиПроживания.ДетальныеЗаписи КАК Детали
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриказОбУстанволенииСтоимостиПроживания КАК Шапка
	|		ПО Детали.Ссылка = Шапка.Ссылка
	|ГДЕ
	|	Детали.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Детали.НомерСтроки";
#КонецОбласти
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.СтоимостьПроживанияВОбщежитии.Добавить(), Выборка);
	КонецЦикла;
	
	Движения.СтоимостьПроживанияВОбщежитии.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 

#КонецЕсли


